In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/Users/jojomac/introduction_python/dataset/titanic/train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 1. Data Cleaning 

Data Cleaning merupakan proses untuk membersihkan data menjadi lebih mudah dimengerti menjadi lebih informatif, dan menghapus data data yang rusak atau data data yang tidak terlalu diperlukan dalam proses analysis. Data Cleaning dapat meliputi menghapus data null, mengganti data dan nilai tertentu, dll

In [4]:
# Mengecek berapa jumlah null value pada masing masing kolom. 
jumlah_missing = pd.isnull(df).sum()
jumlah_missing

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
jumlah_missing = pd.isnull(df).sum()
jumlah_missing

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
# menghitung ratio missing value pada metrics cabin
rasio = jumlah_missing.div(len(df))
rasio

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [7]:
rasio = jumlah_missing.div(len(df))

In [8]:
#hapus kolom cabin
# Kolom Cabin memiliki jumlah missing value hingga 77% sehingga kolom Kabin lebih baik dihilangkan (drop) dari table
df = df.drop(['Cabin'], axis=1)

In [9]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [10]:
# Statistik descriptif dari variabel age
df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [11]:
df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [12]:
# menghitung ratio missing value pada metrics cabin
rasio = jumlah_missing.div(len(df))
rasio

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

### 1.1 Handling Kolom Numerikal

Setelah mengahapus kolom cabin nyatanya masih terdapat beberapa missing value pada dataset kita, ada beberapa hal yang bisa dilakukan, untuk data numerikal yaitu dengan menghapus datanull tersebut, atau melakukan inputation. Apabila nilai mean dengan median tidak terlalu jauh maka efektifnya adlaah dengan inputation, biasanya dengan mengganti dengan nilai rata rata kolom tersebut

In [13]:
# Mengubah NaNs dengan nilai Mean 
df['Age'].fillna(int(df['Age'].mean()), inplace=True)

In [14]:
df['Age'].fillna(int(df['Age'].mean()), inplace=True)

In [15]:
# Cek kembali apakah masih terdapat missing value
pd.isnull(df).sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [16]:
df['Age'].mean()

29.56023569023569

### 1.2 Handling Kategorikal

Handling Kategorikal biasanya dilakukan dengan nilai modus / data yang paling sering langsung

In [17]:
df['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [18]:
df['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [19]:
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [20]:
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace = True)

In [21]:
# Cek kembali apakah masih terdapat missing value
pd.isnull(df).sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

### 1.3 Check Duplicate Value

In [22]:
# Mengidentifikasi apakah terdapat duplicate value pada tabel dengan acuan kolom PassengerId
df[df["PassengerId"].duplicated(keep=False)].sort_values("PassengerId")

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Embarked]
Index: []

## 2. Data Manipulation

### 2.1 Mengganti tipe data

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [25]:
# Mengecek tipe data salah satu kolom
df["Parch"].dtypes

dtype('int64')

In [26]:
# Mengubah data type
df['Parch_string'] = df['Parch'].astype(str)
df['PassengerId_string'] = df['PassengerId'].astype(str)

In [27]:
df['Parch_string'] = df['Parch'].astype(str)

In [28]:
# Cek kembali tipe data
df["Parch_string"].dtypes

dtype('O')

In [29]:
df["PassengerId_string"].dtypes

dtype('O')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   PassengerId         891 non-null    int64
 1   Survived            891 non-null    int64
 2   Pclass              891 non-null    int64
 3   Name                891 non-null    object
 4   Sex                 891 non-null    object
 5   Age                 891 non-null    float64
 6   SibSp               891 non-null    int64
 7   Parch               891 non-null    int64
 8   Ticket              891 non-null    object
 9   Fare                891 non-null    float64
 10  Embarked            891 non-null    object
 11  Parch_string        891 non-null    object
 12  PassengerId_string  891 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 90.6+ KB

In [31]:
df['Parch'] = df['Parch'].astype(str)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   PassengerId         891 non-null    int64
 1   Survived            891 non-null    int64
 2   Pclass              891 non-null    int64
 3   Name                891 non-null    object
 4   Sex                 891 non-null    object
 5   Age                 891 non-null    float64
 6   SibSp               891 non-null    int64
 7   Parch               891 non-null    object
 8   Ticket              891 non-null    object
 9   Fare                891 non-null    float64
 10  Embarked            891 non-null    object
 11  Parch_string        891 non-null    object
 12  PassengerId_string  891 non-null    object
dtypes: float64(2), int64(4), object(7)
memory usage: 90.6+ KB

### 2.2 Rename Column

In [33]:
df = df.rename(columns={"Pclass": "PassengerClass", "Sex": "Gender", "SibSp":"Sibling", "Parch":"Parent"})

In [34]:
df = df.rename(columns= {"Pclass" : "PassengerClass", "Sex":"Gender"})

In [35]:
df.head()

,PassengerId,Survived,PassengerClass,Name,Gender,Age,Sibling,Parent,Ticket,Fare,Embarked,Parch_string,PassengerId_string
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,0,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,0,4
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0,5

### 2.3 Remove kolom yang tidak diperlukan

In [36]:
df = df.drop(['Parch_string','PassengerId_string'],axis = 1)

In [37]:
df.head()

,PassengerId,Survived,PassengerClass,Name,Gender,Age,Sibling,Parent,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [38]:
# Memfilter seluruh data penumpang laki-laki
male = df[df['Gender'] == 'male']

In [39]:
male = df[df['Gender']== 'male']

In [40]:
male

,PassengerId,Survived,PassengerClass,Name,Gender,Age,Sibling,Parent,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
5,6,0,3,"Moran, Mr. James",male,29.0,0,0,330877,8.4583,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,S
...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [41]:
embarked = df[df['Embarked']== 'S']
embarked

,PassengerId,Survived,PassengerClass,Name,Gender,Age,Sibling,Parent,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,S
...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,S

In [42]:
# Memfilter seluruh data penumpangan balita (usia 5 tahun ke bawah)
balita = df[df['Age'] <= 5]

In [43]:
balita.head(10)

,PassengerId,Survived,PassengerClass,Name,Gender,Age,Sibling,Parent,Ticket,Fare,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,S
16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,Q
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,C
58,59,1,2,"West, Miss. Constance Mirium",female,5.00,1,2,C.A. 34651,27.7500,S
63,64,0,3,"Skoog, Master. Harald",male,4.00,3,2,347088,27.9000,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,S
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.00,4,2,347082,31.2750,S
164,165,0,3,"Panula, Master. Eino Viljami",male,1.00,4,1,3101295,39.6875,S
171,172,0,3,"Rice, Master. Arthur",male,4.00,4,1,382652,29.1250,Q

## 3. Data Wrangling

### 3.1 Merging

In [44]:
survived = df[['PassengerId','Survived']]
age = df[['PassengerId','Age']]

In [45]:
survived = df[['PassengerId','Survived']]
survived

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]

In [46]:
age = df[['PassengerId','Age']]
age

     PassengerId   Age
0              1  22.0
1              2  38.0
2              3  26.0
3              4  35.0
4              5  35.0
..           ...   ...
886          887  27.0
887          888  19.0
888          889  29.0
889          890  26.0
890          891  32.0

[891 rows x 2 columns]

In [47]:
# Menggabungkan Tabel survived dengan tabel Age dengan PassengerId menjadi key nya
df_new = survived.merge(age, how='left', on='PassengerId')

In [48]:
df_new

     PassengerId  Survived   Age
0              1         0  22.0
1              2         1  38.0
2              3         1  26.0
3              4         1  35.0
4              5         0  35.0
..           ...       ...   ...
886          887         0  27.0
887          888         1  19.0
888          889         0  29.0
889          890         1  26.0
890          891         0  32.0

[891 rows x 3 columns]

### 3.2 Group by

In [49]:
df.groupby(by=["Survived", "Gender"], dropna=False).count()[['PassengerId']]

                 PassengerId
Survived Gender
0        female           81
         male            468
1        female          233
         male            109

In [50]:
df.groupby(by=["Survived","Gender"], dropna = False).count()[['PassengerId']]

                 PassengerId
Survived Gender
0        female           81
         male            468
1        female          233
         male            109

### 3.3 Correlation

In [51]:
df.corr()

/var/folders/5j/v_4hb3zs0cvf0rqvnnvj0fsw0000gp/T/ipykernel_2210/1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

,PassengerId,Survived,PassengerClass,Age,Sibling,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.033632,-0.057527,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.067814,-0.035322,0.257307
PassengerClass,-0.035144,-0.338481,1.000000,-0.334974,0.083081,-0.549500
Age,0.033632,-0.067814,-0.334974,1.000000,-0.232978,0.093706
Sibling,-0.057527,-0.035322,0.083081,-0.232978,1.000000,0.159651
Fare,0.012658,0.257307,-0.549500,0.093706,0.159651,1.000000